content/posts/video-games-for-the-win.md
+++
title = "Video games, interactivity and freedom"
date = 2020-05-28
lastmod = 2020-05-29T20:10:19+03:00
tags = ["rant"]
categories = ["rants"]
draft = true
weight = 2002
+++

Due to their inherently commercial nature, video games have not enjoyed for many
years the amount of prestige that movies, and fiction books had and have.  This
trend has begin in recent years, and that is because video games have reached a
**threshold maturity-level** fairly quickly.


## From tech demo to art {#from-tech-demo-to-art}

If we're being honest, every medium which now we take for granted, began it's
life as a tech demo. There could be made an exception here with cave paintings,
but I would rescue my argument with [bicameralism](https://en.wikipedia.org/wiki/Bicameralism%5F(psychology)) which will get it's own blog
post down the line. I would define a medium which can hold art as a deliberate
and conscious method to create an object of beauty or conveyor of human emotions
which could of course show our longing for the transcendent or explain our origins for that
matter.

My main argument here is that the first written records of the Sumerians weren't the
tales of Gilgames, but rather the discovery, that hey, if we make a system out
of symbols, and carve it in a rock, we can store information. The cave paintings
held similar functions initially. The horns made out of bone signaled a
successful hunt, or scared off animals, and eventually striked fear in the
hearts of the enemies. These were pragmatic functions, but we humans, are a
weird bunch of apes, and find new uses for just about every piece of technology
we use, just for the sake of our amusement or willingness to escape our world.

The tech demo for the video game was of course Pong. There might have been other
precursors, but I'm not a historian but a mere blogger, and this was to most
notable. It was released in 1972, and truly revolutionized the world of
entertainment. By then, the invention of the [Lumière](https://en.wikipedia.org/wiki/Cinematography#Film%5Fcinematography) brothers was well regarded
and prominent, having wonderful artists like Stanley Kubrick, Andrei Tarkovsky
and Alfred Hitchkock, and music and literature have been shaping the our
not-so-bicameral minds for milleniums. This unassuming little piece of work
consisted of two vertical bars, tossing a ball between each other. Hell, I could
play with cardboard cut-out stick figures today, and it would be more quality
entertainment, but everything has to start somewhere.

_INSERT PICTURE OF PONG_

The next natural progression were the RPG type games.
